const MOR10_relative_100000 = `""KOPĀ";"2015";137.49;120.05;129.86;121.97;117.17;110.74;114.69;111.91;104.88;118.94;113.53;124.35
"KOPĀ";"2016";144.73;117.94;131.97;120.69;119.72;115.18;107.12;113.24;107.58;120.28;118.70;122.73
"KOPĀ";"2017";138.19;133.66;135.77;122.28;119.71;111.26;112.34;107.81;114.35;121.56;119.55;128.77
"KOPĀ";"2018";132.89;125.31;158.26;130.87;119.92;104.87;122.77;110.63;110.11;117.94;115.14;131.59
"KOPĀ";"2019";148.08;124.52;127.55;119.34;115.79;107.59;114.43;104.45;111.66;118.82;113.44;130.47
"KOPĀ";"2020";131.42;115.59;123.40;120.41;120.93;116.90;114.38;116.21;112.18;124.03;132.36;170.00
"KOPĀ";"2021";185.93;145.94;134.19;...;...;...;...;...;...;...;...;...
"Infekcijas un parazitāras slimības (A00-B99)";"2015";1.47;1.82;0.96;1.26;1.16;1.62;1.42;1.11;1.52;1.16;1.16;0.96
"Infekcijas un parazitāras slimības (A00-B99)";"2016";1.84;1.17;2.14;1.07;1.48;0.71;1.02;1.43;1.22;1.33;1.17;1.17
"Infekcijas un parazitāras slimības (A00-B99)";"2017";1.49;1.49;1.34;1.34;1.24;1.24;1.49;1.44;1.44;1.18;0.98;1.29
"Infekcijas un parazitāras slimības (A00-B99)";"2018";1.61;1.56;2.18;1.50;0.99;1.19;1.19;1.25;1.30;1.04;1.09;1.50
"Infekcijas un parazitāras slimības (A00-B99)";"2019";1.36;1.83;1.72;1.78;0.99;1.57;1.25;2.09;1.72;1.78;1.20;1.83
"Infekcijas un parazitāras slimības (A00-B99)";"2020";1.57;1.05;1.47;1.15;1.26;1.21;1.26;1.42;0.73;1.78;1.05;1.05
"Infekcijas un parazitāras slimības (A00-B99)";"2021";1.05;1.15;1.10;...;...;...;...;...;...;...;...;...
"Audzēji (C00-D48)";"2015";27.21;24.07;27.91;25.33;23.56;24.12;23.82;26.35;24.88;24.48;23.11;28.12
"Audzēji (C00-D48)";"2016";27.56;24.55;24.75;25.92;25.11;24.19;25.47;26.95;24.65;25.82;25.98;26.89
"Audzēji (C00-D48)";"2017";27.08;25.49;28.58;24.77;27.08;26.00;26.52;26.26;25.85;26.67;25.18;26.57
"Audzēji (C00-D48)";"2018";28.12;23.92;29.16;24.75;24.86;23.35;29.11;24.80;25.94;25.89;27.29;27.97
"Audzēji (C00-D48)";"2019";28.01;25.55;25.76;27.38;27.12;24.61;27.85;25.97;25.13;27.38;27.17;26.49
"Audzēji (C00-D48)";"2020";26.58;25.53;26.89;26.16;27.00;26.47;25.95;27.57;26.37;29.72;26.52;26.21
"Audzēji (C00-D48)";"2021";26.05;21.81;24.22;...;...;...;...;...;...;...;...;...
"..Ļaundabīgi audzēji (C00-C97)";"2015";26.50;23.67;27.61;24.88;22.96;23.77;23.51;25.59;24.42;24.12;22.65;27.46
"..Ļaundabīgi audzēji (C00-C97)";"2016";26.89;24.09;24.09;25.47;24.55;23.73;24.95;26.23;24.09;25.11;25.26;26.43
"..Ļaundabīgi audzēji (C00-C97)";"2017";26.62;24.92;27.75;24.15;26.46;25.64;26.05;25.74;25.28;26.00;24.30;25.38
"..Ļaundabīgi audzēji (C00-C97)";"2018";27.55;23.51;28.54;23.87;24.39;22.94;28.49;24.08;24.96;25.11;26.88;27.50
"..Ļaundabīgi audzēji (C00-C97)";"2019";27.17;24.71;24.87;26.70;26.18;23.83;27.28;25.13;24.45;26.96;26.18;26.07
"..Ļaundabīgi audzēji (C00-C97)";"2020";25.90;25.06;26.37;25.79;26.21;26.05;25.69;27.10;25.63;29.04;26.00;25.48
"..Ļaundabīgi audzēji (C00-C97)";"2021";25.58;21.18;23.75;...;...;...;...;...;...;...;...;...
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2015";0.15;0.35;0.05;0.25;0.25;0.10;0;0;0.05;0;0;0.20
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2016";0.10;0.15;0.15;0.10;0.20;0;0.15;0;0.10;0.20;0.36;0.15
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2017";0.15;0.21;0.10;0.10;0.15;0.10;0.10;0.26;0.05;0.05;0.41;0.05
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2018";0.31;0.16;0.36;0.36;0.26;0.21;0;0.16;0.21;0.21;0.47;0.21
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2019";0.10;0.05;0.16;0.16;0.16;0.05;0.05;0.05;0.10;0.05;0.10;0.31
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2020";0.16;0.10;0.10;0.05;0.21;0.21;0.21;0.16;0.26;0.26;0.26;0.10
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2021";0.16;0;0.10;...;...;...;...;...;...;...;...;...
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2015";2.43;1.57;2.53;2.73;2.28;2.28;2.12;1.57;1.82;2.33;1.97;1.97
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2016";3.01;2.04;3.01;1.68;2.86;2.19;2.09;2.96;2.30;2.91;2.81;2.45
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2017";2.78;2.68;3.30;2.16;2.78;2.99;2.01;2.27;2.47;2.47;2.63;2.73
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2018";2.75;3.01;3.27;2.49;2.91;2.85;3.22;2.08;1.92;2.28;2.34;3.01
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2019";4.39;2.66;3.61;2.35;3.03;2.98;2.72;2.82;2.87;3.40;3.03;2.66
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2020";3.09;3.41;2.46;2.52;3.15;3.15;3.30;3.51;3.35;3.93;4.25;4.35
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2021";4.40;3.67;2.99;...;...;...;...;...;...;...;...;...
"Psihiski un uzvedības traucējumi (F00-F99)";"2015";1.31;1.31;1.82;2.28;1.67;1.87;1.92;2.48;1.31;1.42;1.52;1.82
"Psihiski un uzvedības traucējumi (F00-F99)";"2016";1.99;2.30;2.14;1.48;1.99;1.63;1.94;1.94;1.58;1.94;1.79;2.19
"Psihiski un uzvedības traucējumi (F00-F99)";"2017";1.60;2.73;2.57;2.42;2.63;1.96;2.01;1.70;2.37;2.37;1.85;2.88
"Psihiski un uzvedības traucējumi (F00-F99)";"2018";2.80;2.65;3.37;2.54;2.59;1.45;2.85;3.17;2.65;2.34;2.54;3.22
"Psihiski un uzvedības traucējumi (F00-F99)";"2019";3.81;3.03;2.93;2.25;2.19;2.35;2.30;1.67;2.35;2.51;2.14;2.66
"Psihiski un uzvedības traucējumi (F00-F99)";"2020";3.15;2.52;3.67;2.88;3.04;3.09;2.62;3.15;2.10;2.62;2.94;3.77
"Psihiski un uzvedības traucējumi (F00-F99)";"2021";4.09;3.72;2.46;...;...;...;...;...;...;...;...;...
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2015";0.76;0.30;0.96;1.21;0.56;0.81;1.06;1.01;0.61;0.71;0.56;0.61
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2016";0.36;0.36;0.41;0.51;0.56;0.66;0.41;0.51;0.46;0.41;0.61;0.51
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2017";0.36;0.51;0.57;0.41;0.41;0.41;0.41;0.62;0.72;0.57;0.46;1.03
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2018";0.73;0.47;0.88;0.52;0.42;0.52;0.36;0.73;0.47;0.36;0.62;0.67
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2019";0.78;0.26;0.42;0.57;0.47;0.42;0.21;0.26;0.26;0.26;0.26;0.42
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2020";0.63;0.37;0.58;0.63;0.47;0.68;0.42;0.94;0.16;0.42;0.26;0.58
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2021";0.63;0.68;0.63;...;...;...;...;...;...;...;...;...
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2015";1.67;1.11;1.21;1.21;1.97;1.57;1.42;1.72;2.07;1.47;1.97;1.57
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2016";1.74;1.33;2.19;1.84;1.53;1.99;1.68;1.74;1.84;1.48;1.99;1.48
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2017";2.37;2.57;2.01;2.11;1.91;1.44;1.91;1.85;2.63;2.11;1.65;1.91
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2018";1.66;2.49;2.75;2.08;2.02;2.18;1.97;2.18;1.82;2.34;2.18;2.70
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2019";3.34;2.35;1.67;2.09;1.41;1.93;2.61;1.67;1.67;1.67;1.78;2.35
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2020";2.10;2.15;1.36;1.68;1.99;2.04;3.04;1.36;1.68;1.73;1.52;2.25
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2021";2.46;1.99;1.83;...;...;...;...;...;...;...;...;...
"Asinsrites sistēmas slimības (I00-I99)";"2015";81.82;71.40;74.89;69.13;67.81;63.31;64.27;59.32;57.29;69.78;65.33;71.55
"Asinsrites sistēmas slimības (I00-I99)";"2016";83.54;67.26;75.37;70.88;68.33;65.27;58.64;59.96;58.07;66.75;65.88;68.94
"Asinsrites sistēmas slimības (I00-I99)";"2017";81.04;76.35;75.58;69.61;67.71;59.72;60.60;57.82;61.22;66.47;67.34;71.62
"Asinsrites sistēmas slimības (I00-I99)";"2018";75.45;71.30;91.43;74.62;67.30;56.97;63.62;56.92;57.91;66.31;62.42;73.42
"Asinsrites sistēmas slimības (I00-I99)";"2019";82.51;67.25;69.96;65.37;64.43;57.63;61.08;54.13;61.03;65.21;60.30;75.03
"Asinsrites sistēmas slimības (I00-I99)";"2020";75.22;63.59;68.77;67.31;66.05;62.96;61.70;61.12;61.91;64.37;71.24;84.13
"Asinsrites sistēmas slimības (I00-I99)";"2021";93.20;73.96;71.08;...;...;...;...;...;...;...;...;...
"..Akūts miokarda infarkts (I21-I22)";"2015";5.87;5.11;4.75;4.55;5.16;4.60;5.21;4.30;4.30;4.65;4.50;6.17
"..Akūts miokarda infarkts (I21-I22)";"2016";6.53;5.05;4.90;5.21;4.85;4.18;3.93;4.03;3.32;4.29;4.59;4.64
"..Akūts miokarda infarkts (I21-I22)";"2017";4.99;4.32;4.43;4.38;4.58;4.07;3.96;3.91;3.55;4.79;5.20;3.86
"..Akūts miokarda infarkts (I21-I22)";"2018";4.62;4.77;4.25;4.36;3.79;3.63;3.22;3.42;2.80;4.15;3.32;3.63
"..Akūts miokarda infarkts (I21-I22)";"2019";4.55;4.55;4.23;4.39;3.40;2.82;4.23;2.87;3.34;3.66;2.30;4.08
"..Akūts miokarda infarkts (I21-I22)";"2020";4.25;3.98;3.83;3.56;3.98;3.35;2.62;4.04;3.72;3.46;3.56;3.98
"..Akūts miokarda infarkts (I21-I22)";"2021";4.72;4.30;3.88;...;...;...;...;...;...;...;...;...
"..Hemorāģisks insults (I60-I62)";"2015";3.08;2.53;2.58;2.33;1.97;1.57;2.33;2.07;1.37;2.28;2.02;2.02
"..Hemorāģisks insults (I60-I62)";"2016";1.79;2.14;1.89;2.40;1.94;1.89;1.84;1.53;2.19;1.99;1.94;1.84
"..Hemorāģisks insults (I60-I62)";"2017";2.32;1.75;2.32;1.60;1.54;1.96;1.80;2.06;1.65;1.80;1.70;2.21
"..Hemorāģisks insults (I60-I62)";"2018";2.18;1.82;2.59;1.56;2.44;1.82;2.08;1.76;1.56;2.13;1.61;2.18
"..Hemorāģisks insults (I60-I62)";"2019";2.09;1.72;1.52;1.67;1.57;1.83;1.20;1.31;1.57;1.57;1.78;2.19
"..Hemorāģisks insults (I60-I62)";"2020";1.68;1.99;1.68;1.83;1.89;1.83;1.15;1.83;1.78;1.83;1.78;1.78
"..Hemorāģisks insults (I60-I62)";"2021";1.89;2.15;2.25;...;...;...;...;...;...;...;...;...
".. Išēmisks insults (I63-I64)";"2015";9.51;8.50;8.95;8.70;8.80;8.24;7.18;6.83;6.32;8.34;8.50;9.05
".. Išēmisks insults (I63-I64)";"2016";9.19;7.96;8.73;8.32;7.40;7.86;5.41;6.69;6.43;7.25;6.12;7.55
".. Išēmisks insults (I63-I64)";"2017";8.39;8.39;7.52;6.44;8.55;6.49;7.05;6.18;6.18;6.18;6.28;8.55
".. Išēmisks insults (I63-I64)";"2018";7.84;7.32;9.50;7.84;7.32;5.14;5.09;5.86;5.24;7.42;6.85;7.01
".. Išēmisks insults (I63-I64)";"2019";7.94;7.21;7.73;5.85;5.23;5.59;5.80;4.18;5.96;6.69;6.27;5.90
".. Išēmisks insults (I63-I64)";"2020";6.29;6.97;6.34;5.92;5.29;5.14;5.87;4.98;5.29;5.92;7.13;6.71
".. Išēmisks insults (I63-I64)";"2021";8.23;5.50;6.13;...;...;...;...;...;...;...;...;...
"Elpošanas sistēmas slimības (J00-J99)";"2015";3.74;3.44;4.30;3.19;3.49;2.23;2.78;2.68;1.67;2.43;3.69;2.38
"Elpošanas sistēmas slimības (J00-J99)";"2016";4.24;4.13;5.15;3.67;3.16;3.22;2.14;3.47;2.91;3.73;2.91;3.22
"Elpošanas sistēmas slimības (J00-J99)";"2017";4.84;6.18;5.35;3.66;3.14;2.21;2.47;2.37;2.73;3.45;3.55;3.40
"Elpošanas sistēmas slimības (J00-J99)";"2018";3.84;5.29;8.35;6.49;3.89;2.59;2.44;3.11;2.75;3.37;2.18;3.48
"Elpošanas sistēmas slimības (J00-J99)";"2019";6.17;5.85;4.75;3.14;2.98;2.35;2.04;2.77;2.30;3.03;2.19;3.14
"Elpošanas sistēmas slimības (J00-J99)";"2020";4.14;3.25;3.62;3.56;3.04;1.73;2.52;3.15;2.52;3.15;3.15;3.56
"Elpošanas sistēmas slimības (J00-J99)";"2021";3.41;2.94;2.36;...;...;...;...;...;...;...;...;...
"..Gripa un pneimonija (J09-J18)";"2015";2.02;1.77;2.48;1.77;1.26;0.96;1.16;1.47;1.06;0.91;1.82;1.47
"..Gripa un pneimonija (J09-J18)";"2016";2.81;2.30;2.81;2.04;1.68;1.17;0.97;1.74;1.02;1.58;1.58;1.38
"..Gripa un pneimonija (J09-J18)";"2017";2.99;3.60;3.35;2.01;1.70;1.03;1.08;1.29;1.18;1.54;1.80;1.49
"..Gripa un pneimonija (J09-J18)";"2018";1.92;3.37;5.76;3.63;2.02;0.93;1.40;1.82;1.56;1.71;1.04;1.76
"..Gripa un pneimonija (J09-J18)";"2019";3.55;4.34;2.98;1.67;1.25;1.10;1.20;1.25;1.05;1.57;1.36;1.78
"..Gripa un pneimonija (J09-J18)";"2020";2.46;1.73;1.78;1.73;1.78;0.68;1.05;1.63;1.21;1.68;1.78;2.25
"..Gripa un pneimonija (J09-J18)";"2021";2.04;1.73;1.26;...;...;...;...;...;...;...;...;...
"Gremošanas sistēmas slimības (K00-K93)";"2015";4.80;3.49;4.65;4.91;4.10;4.25;4.91;4.40;4.55;4.25;3.44;3.59
"Gremošanas sistēmas slimības (K00-K93)";"2016";6.17;4.34;5.15;3.57;4.39;4.13;3.78;3.98;4.54;4.49;3.98;4.39
"Gremošanas sistēmas slimības (K00-K93)";"2017";4.69;3.60;4.79;4.74;3.19;4.07;3.96;3.35;4.69;4.99;4.94;5.46
"Gremošanas sistēmas slimības (K00-K93)";"2018";4.62;4.36;5.14;5.14;4.46;4.46;5.03;4.36;4.93;4.05;4.98;4.25
"Gremošanas sistēmas slimības (K00-K93)";"2019";4.91;4.55;4.96;4.49;4.34;3.81;3.40;3.71;4.34;4.28;4.65;4.96
"Gremošanas sistēmas slimības (K00-K93)";"2020";3.51;4.25;4.09;4.72;4.51;4.61;3.88;4.30;3.20;5.03;4.77;4.77
"Gremošanas sistēmas slimības (K00-K93)";"2021";4.88;5.14;5.08;...;...;...;...;...;...;...;...;...
"Ādas un zemādas audu slimības (L00-L99)";"2015";0.15;0.30;0.40;0.20;0.25;0.40;0.25;0.35;0.05;0.10;0.20;0.20
"Ādas un zemādas audu slimības (L00-L99)";"2016";0.66;0.20;0.36;0.20;0.10;0.20;0.20;0.20;0.46;0.41;0.20;0.20
"Ādas un zemādas audu slimības (L00-L99)";"2017";0.31;0.36;0.15;0.21;0.10;0.36;0.21;0.15;0.36;0.36;0.31;0.10
"Ādas un zemādas audu slimības (L00-L99)";"2018";0.36;0.47;0.52;0.42;0.10;0.21;0.57;0.47;0.16;0.42;0.31;0.42
"Ādas un zemādas audu slimības (L00-L99)";"2019";0.21;0.42;0.26;0.21;0.16;0.37;0.21;0.16;0.42;0.31;0.31;0.42
"Ādas un zemādas audu slimības (L00-L99)";"2020";0.26;0.42;0.42;0.21;0.31;0.42;0.37;0.16;0.42;0.47;0.21;0.58
"Ādas un zemādas audu slimības (L00-L99)";"2021";0.31;0.26;0.26;...;...;...;...;...;...;...;...;...
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2015";0.20;0.51;0.56;0.66;0.35;0.20;0.15;0.40;0.20;0.20;0.66;0.56
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2016";0.26;0.36;0.26;0.26;0.41;0.31;0.31;0.26;0.56;0.26;0.31;0.36
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2017";0.36;0.41;0.41;0.36;0.15;0.31;0.26;0.26;0.21;0.21;0.51;0.36
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2018";0.36;0.47;0.31;0.16;0.31;0.42;0.31;0.73;0.57;0.67;0.47;0.62
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2019";0.42;0.37;0.52;0.73;0.42;0.47;0.47;0.63;0.47;0.47;0.89;0.52
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2020";0.21;0.47;0.47;0.47;0.52;0.31;0.21;0.47;0.21;0.63;0.47;0.42
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2021";0.31;0.37;0.37;...;...;...;...;...;...;...;...;...
"Uroģenitālās sistēmas slimības (N00-N99)";"2015";1.82;1.62;1.92;1.87;1.47;1.77;1.31;1.77;1.82;1.57;1.52;1.21
"Uroģenitālās sistēmas slimības (N00-N99)";"2016";2.40;1.58;1.84;1.48;1.33;2.30;1.38;1.28;1.63;1.94;1.79;2.09
"Uroģenitālās sistēmas slimības (N00-N99)";"2017";1.70;2.21;2.27;2.11;1.65;1.54;1.80;1.60;1.80;1.54;1.49;1.80
"Uroģenitālās sistēmas slimības (N00-N99)";"2018";1.71;2.28;2.13;2.13;1.71;1.25;1.97;2.08;1.56;1.82;1.97;1.50
"Uroģenitālās sistēmas slimības (N00-N99)";"2019";3.19;1.83;2.72;1.52;1.88;1.72;1.52;1.78;1.67;1.62;2.09;2.19
"Uroģenitālās sistēmas slimības (N00-N99)";"2020";2.15;2.41;1.89;1.78;1.94;1.83;1.68;2.25;2.04;1.63;1.68;1.68
"Uroģenitālās sistēmas slimības (N00-N99)";"2021";1.89;1.63;2.04;...;...;...;...;...;...;...;...;...
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2015";0.15;0;0.05;0;0;0.05;0.05;0.10;0.05;0;0;0.15
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2016";0;0;0;0;0.05;0;0;0;0.05;0;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2017";0;0;0;0;0;0;0;0;0;0.05;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2018";0;0;0;0;0;0;0.05;0.05;0;0.05;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2019";0;0;0;0.05;0.05;0.05;0.05;0.05;0;0;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2020";0;0;0;0.05;0;0;0.05;0;0.05;0;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2021";0;0;0;...;...;...;...;...;...;...;...;...
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2015";0.35;0.20;0.20;0.10;0.10;0.25;0.10;0.25;0.15;0.25;0.20;0
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2016";0.36;0.20;0.10;0.36;0.26;0.15;0.10;0.31;0.10;0.10;0.15;0
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2017";0.72;0.15;0.05;0.31;0.15;0.31;0.21;0.36;0.10;0.15;0.10;0.10
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2018";0.21;0.10;0.16;0.10;0;0.26;0.16;0.16;0.16;0.21;0.16;0.05
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2019";0.16;0.16;0.16;0;0.16;0.16;0.47;0.10;0.10;0.31;0.05;0.16
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2020";0.21;0.16;0.16;0.21;0.26;0.10;0.10;0;0.16;0.26;0.05;0.16
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2021";0.10;0.10;0.21;...;...;...;...;...;...;...;...;...
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2015";0.25;0.15;0.15;0.10;0.25;0.20;0.20;0.30;0.30;0.40;0.15;0.15
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2016";0.41;0.26;0.51;0.36;0.26;0.20;0.26;0.05;0.15;0.15;0.15;0.20
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2017";0.21;0.26;0.36;0.15;0.10;0.15;0.10;0.05;0.15;0.05;0.26;0.21
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2018";0.21;0.16;0.21;0.26;0.26;0.16;0.16;0.16;0.10;0.21;0.26;0.10
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2019";0.26;0.05;0.05;0.16;0.16;0.16;0.16;0.21;0.21;0.21;0.10;0.10
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2020";0.42;0.21;0.10;0.16;0.26;0.05;0.21;0.10;0.16;0.10;0;0.21
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2021";0.16;0.10;0;...;...;...;...;...;...;...;...;...
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2015";1.31;1.82;1.21;1.67;1.37;1.31;1.31;1.11;1.06;1.06;1.21;1.26
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2016";1.53;1.48;1.68;1.22;1.63;2.14;1.89;1.43;1.22;0.77;1.33;0.92
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2017";1.29;1.44;1.96;1.49;1.49;1.70;1.80;1.44;1.34;1.60;1.08;1.65
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2018";0.83;0.99;1.82;1.50;1.61;1.56;2.34;1.66;1.14;0.67;0.73;1.30
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2019";1.78;1.93;2.09;1.88;1.31;1.36;2.30;1.05;1.10;1.25;1.41;1.05
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2020";1.68;1.10;1.83;1.26;1.47;1.94;1.36;0.89;1.00;0.94;1.52;1.78
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2021";1.89;1.10;1.26;...;...;...;...;...;...;...;...;...
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2015";8.65;6.88;7.03;7.08;7.08;5.21;8.65;7.99;6.07;8.04;7.38;8.65
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2016";8.93;6.58;7.14;6.58;6.63;6.53;6.07;7.30;6.17;8.01;7.91;8.06
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2017";7.57;7.52;6.95;6.74;6.23;7.16;6.90;6.64;6.95;7.83;7.26;8.65
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2018";8.04;6.12;7.11;6.33;6.64;5.76;7.78;7.32;7.01;6.07;5.76;7.84
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2019";7.47;6.64;6.22;5.80;5.02;6.01;5.96;5.59;6.17;5.33;6.01;6.58
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2020";6.97;4.98;6.08;5.77;5.77;6.66;5.87;6.55;5.92;6.13;6.13;7.08
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2021";7.92;6.19;4.77;...;...;...;...;...;...;...;...;...
"..Transporta nelaimes gadījumi (V01-V99)";"2015";1.31;0.35;0.40;0.71;0.46;0.76;0.96;1.57;1.01;1.11;1.06;1.31
"..Transporta nelaimes gadījumi (V01-V99)";"2016";0.66;0.56;0.82;0.71;0.71;0.97;0.87;0.92;1.12;0.92;0.87;0.77
"..Transporta nelaimes gadījumi (V01-V99)";"2017";0.77;0.67;0.51;0.51;0.57;0.72;0.57;0.62;1.03;0.57;0.62;0.77
"..Transporta nelaimes gadījumi (V01-V99)";"2018";0.88;0.52;0.36;0.47;0.62;0.78;0.47;0.88;0.99;1.19;0.78;1.14
"..Transporta nelaimes gadījumi (V01-V99)";"2019";0.47;0.73;0.68;0.57;0.89;0.73;0.57;0.73;0.63;0.73;0.94;0.63
"..Transporta nelaimes gadījumi (V01-V99)";"2020";1.00;0.42;0.42;0.26;0.42;0.79;0.37;0.84;1.00;0.79;0.89;0.79
"..Transporta nelaimes gadījumi (V01-V99)";"2021";0.52;0.47;0.10;...;...;...;...;...;...;...;...;...
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2015";0.05;0.35;0.46;0.30;0.66;0.56;1.11;1.21;0.05;0.46;0.51;0.66
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2016";0.15;0.46;0.46;0.41;0.77;1.02;0.77;0.87;0.56;0.66;0.36;0.41
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2017";0.21;0.21;0.46;0.51;0.62;0.62;0.82;0.93;0.67;0.62;0.57;0.51
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2018";0.21;0.10;0.16;0.67;0.73;0.83;1.61;0.83;0.57;0.26;0.21;0.26
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2019";0.21;0.31;0.47;0.42;0.47;0.99;0.84;0.37;0.37;0.31;0.37;0.31
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2020";0.21;0.21;0.47;0.31;0.63;1.21;1.00;0.58;0.37;0.26;0.58;0.89
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2021";0.21;0.10;0.37;...;...;...;...;...;...;...;...;...
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2015";0.76;0.51;0.61;0.81;0.30;0.15;0.20;0.10;0.40;0.35;0.61;0.66
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2016";1.02;0.31;0.66;0.71;0.26;0.26;0.26;0.26;0;0.87;0.61;0.71
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2017";0.41;0.82;0.36;0.26;0.41;0.31;0.31;0.10;0.15;0.46;0.67;0.72
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2018";0.57;0.42;0.57;0.21;0.16;0.16;0.36;0.16;0.42;0.57;0.67;0.99
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2019";1.15;0.47;0.57;0.42;0.47;0.10;0.05;0.26;0.21;0.37;0.31;0.63
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2020";1.00;0.31;0.68;0.58;0.42;0.37;0.16;0.21;0.47;0.47;0.37;0.73
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2021";1.21;0.68;0.52;...;...;...;...;...;...;...;...;...
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2015";1.21;0.81;0.40;0.30;0.15;0;0.05;0;0.05;0.56;0.40;0.71
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2016";2.04;0.66;0.71;0.26;0.10;0.05;0.05;0.05;0.10;0.77;0.92;0.97
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2017";1.08;1.13;0.88;0.57;0.10;0;0.10;0;0.10;0.46;0.77;0.93
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2018";0.93;0.83;0.73;0.57;0;0;0;0;0.21;0.31;0.26;0.73
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2019";0.99;0.89;0.63;0.10;0.10;0;0;0;0.37;0.26;0.52;0.78
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2020";0.89;0.58;0.68;0.42;0.16;0;0.10;0;0.10;0.26;0.37;0.89
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2021";1.21;1.15;0.63;...;...;...;...;...;...;...;...;...
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2015";1.16;0.56;0.71;1.06;0.51;0.56;1.01;0.61;0.46;0.81;0.51;0.40
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2016";1.38;0.51;0.77;0.87;0.92;0.31;0.46;0.92;0.77;0.77;0.87;0.66
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2017";0.93;0.72;0.67;1.34;0.57;0.82;0.67;1.08;0.62;1.03;0.88;1.18
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2018";1.40;0.99;1.14;0.83;0.57;0.62;0.52;0.42;0.78;0.57;0.47;0.31
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2019";0.73;0.42;0.52;0.42;0.52;0.57;0.47;0.42;0.47;0.42;0.63;0.99
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2020";0.37;0.42;0.52;1.05;0.58;0.47;0.42;0.37;0.37;0.58;0.42;0.63
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2021";1.00;0.47;0.47;...;...;...;...;...;...;...;...;...
"..Saindēšanās ar alkoholu (X45 Y15)";"2015";0.66;0.40;0.61;0.81;0.30;0.51;0.56;0.51;0.46;0.51;0.25;0.25
"..Saindēšanās ar alkoholu (X45 Y15)";"2016";0.97;0.20;0.61;0.46;0.61;0.20;0.20;0.41;0.46;0.51;0.61;0.41
"..Saindēšanās ar alkoholu (X45 Y15)";"2017";0.72;0.31;0.51;0.98;0.57;0.41;0.36;0.41;0.31;0.57;0.36;0.51
"..Saindēšanās ar alkoholu (X45 Y15)";"2018";0.93;0.42;0.57;0.36;0.26;0.47;0.31;0.26;0.42;0.36;0.36;0.21
"..Saindēšanās ar alkoholu (X45 Y15)";"2019";0.63;0.37;0.31;0.16;0.31;0.31;0.37;0.16;0.31;0.31;0.52;0.63
"..Saindēšanās ar alkoholu (X45 Y15)";"2020";0.16;0.31;0.26;0.63;0.37;0.37;0.31;0.05;0.21;0.16;0.16;0.37
"..Saindēšanās ar alkoholu (X45 Y15)";"2021";0.63;0.16;0.21;...;...;...;...;...;...;...;...;...
"..Tīšs paškaitējums (X60-X84)";"2015";2.07;1.62;1.52;1.67;1.97;1.01;2.33;1.57;1.57;1.57;1.52;1.11
"..Tīšs paškaitējums (X60-X84)";"2016";1.48;1.68;1.79;1.17;1.68;1.53;1.43;1.58;1.48;1.43;1.94;1.38
"..Tīšs paškaitējums (X60-X84)";"2017";1.44;1.49;1.29;1.39;1.85;1.60;1.65;1.49;1.39;1.49;1.60;1.49
"..Tīšs paškaitējums (X60-X84)";"2018";0.99;1.04;1.09;0.93;1.87;1.14;1.82;1.35;1.61;1.19;1.04;1.45
"..Tīšs paškaitējums (X60-X84)";"2019";1.20;1.41;1.25;1.36;0.99;1.25;1.67;1.41;1.31;1.31;0.94;0.94
"..Tīšs paškaitējums (X60-X84)";"2020";1.36;1.00;1.42;1.21;1.21;1.57;1.78;1.68;1.21;1.31;1.21;0.63
"..Tīšs paškaitējums (X60-X84)";"2021";0.89;0.89;0.79;...;...;...;...;...;...;...;...;...
"..Vardarbība (X85-Y09)";"2015";0.46;0.25;0.40;0.35;0.35;0.20;0.40;0.35;0.25;0.66;0.56;0.76
"..Vardarbība (X85-Y09)";"2016";0.71;0.20;0.15;0.66;0.31;0.20;0.41;0.36;0.31;0.71;0.20;0.36
"..Vardarbība (X85-Y09)";"2017";0.57;0.21;0.21;0.10;0.26;0.46;0.41;0.31;0.41;0.26;0.26;0.36
"..Vardarbība (X85-Y09)";"2018";0.42;0.36;0.16;0.31;0.26;0.16;0.31;0.52;0.47;0.21;0.26;0.52
"..Vardarbība (X85-Y09)";"2019";0.37;0.26;0.31;0.31;0.26;0.26;0.47;0.26;0.26;0.05;0.10;0.31
"..Vardarbība (X85-Y09)";"2020";0.37;0.16;0.10;0.26;0.10;0.52;0.26;0.31;0.31;0.31;0.37;0.21
"..Vardarbība (X85-Y09)";"2021";0.16;0.26;0.21;...;...;...;...;...;...;...;...;...
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2015";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2016";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2017";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2018";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2019";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2020";0;0;0;0.47;0.16;0.10;0.05;0.05;0.10;1.26;6.60;27.89
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2021";33.65;21.81;14.00;...;...;...;...;...;...;...;...;...
"..Covid-19 (U07.1, U07.2)";"2015";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2016";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2017";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2018";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2019";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2020";0;0;0;0.47;0.16;0.10;0.05;0.05;0.10;1.26;6.60;27.89
"..Covid-19 (U07.1, U07.2)";"2021";33.65;21.75;13.73;...;...;...;...;...;...;...;...;...
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2015";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2016";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2017";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2018";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2019";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2020";0;0;0;0;0;0;0;0;0;0;0;0
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2021";0;0.05;0.26;...;...;...;...;...;...;...;...;...`;

var MOR10_absolute = `"KOPĀ";"2015";2719;2374;2568;2412;2317;2190;2268;2213;2074;2352;2245;2459
"KOPĀ";"2016";2836;2311;2586;2365;2346;2257;2099;2219;2108;2357;2326;2405
"KOPĀ";"2017";2684;2596;2637;2375;2325;2161;2182;2094;2221;2361;2322;2501
"KOPĀ";"2018";2561;2415;3050;2522;2311;2021;2366;2132;2122;2273;2219;2536
"KOPĀ";"2019";2834;2383;2441;2284;2216;2059;2190;1999;2137;2274;2171;2497
"KOPĀ";"2020";2507;2205;2354;2297;2307;2230;2182;2217;2140;2366;2525;3243
"KOPĀ";"2021";3547;2784;2560;...;...;...;...;...;...;...;...;...
"Infekcijas un parazitāras slimības (A00-B99)";"2015";29;36;19;25;23;32;28;22;30;23;23;19
"Infekcijas un parazitāras slimības (A00-B99)";"2016";36;23;42;21;29;14;20;28;24;26;23;23
"Infekcijas un parazitāras slimības (A00-B99)";"2017";29;29;26;26;24;24;29;28;28;23;19;25
"Infekcijas un parazitāras slimības (A00-B99)";"2018";31;30;42;29;19;23;23;24;25;20;21;29
"Infekcijas un parazitāras slimības (A00-B99)";"2019";26;35;33;34;19;30;24;40;33;34;23;35
"Infekcijas un parazitāras slimības (A00-B99)";"2020";30;20;28;22;24;23;24;27;14;34;20;20
"Infekcijas un parazitāras slimības (A00-B99)";"2021";20;22;21;...;...;...;...;...;...;...;...;...
"Audzēji (C00-D48)";"2015";538;476;552;501;466;477;471;521;492;484;457;556
"Audzēji (C00-D48)";"2016";540;481;485;508;492;474;499;528;483;506;509;527
"Audzēji (C00-D48)";"2017";526;495;555;481;526;505;515;510;502;518;489;516
"Audzēji (C00-D48)";"2018";542;461;562;477;479;450;561;478;500;499;526;539
"Audzēji (C00-D48)";"2019";536;489;493;524;519;471;533;497;481;524;520;507
"Audzēji (C00-D48)";"2020";507;487;513;499;515;505;495;526;503;567;506;500
"Audzēji (C00-D48)";"2021";497;416;462;...;...;...;...;...;...;...;...;...
"..Ļaundabīgi audzēji (C00-C97)";"2015";524;468;546;492;454;470;465;506;483;477;448;543
"..Ļaundabīgi audzēji (C00-C97)";"2016";527;472;472;499;481;465;489;514;472;492;495;518
"..Ļaundabīgi audzēji (C00-C97)";"2017";517;484;539;469;514;498;506;500;491;505;472;493
"..Ļaundabīgi audzēji (C00-C97)";"2018";531;453;550;460;470;442;549;464;481;484;518;530
"..Ļaundabīgi audzēji (C00-C97)";"2019";520;473;476;511;501;456;522;481;468;516;501;499
"..Ļaundabīgi audzēji (C00-C97)";"2020";494;478;503;492;500;497;490;517;489;554;496;486
"..Ļaundabīgi audzēji (C00-C97)";"2021";488;404;453;...;...;...;...;...;...;...;...;...
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2015";3;7;1;5;5;2;0;0;1;0;0;4
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2016";2;3;3;2;4;0;3;0;2;4;7;3
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2017";3;4;2;2;3;2;2;5;1;1;8;1
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2018";6;3;7;7;5;4;0;3;4;4;9;4
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2019";2;1;3;3;3;1;1;1;2;1;2;6
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2020";3;2;2;1;4;4;4;3;5;5;5;2
"Asins un asinsrades orgānu slimības un noteikti imūnsistēmas traucējumi (D50-D89)";"2021";3;0;2;...;...;...;...;...;...;...;...;...
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2015";48;31;50;54;45;45;42;31;36;46;39;39
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2016";59;40;59;33;56;43;41;58;45;57;55;48
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2017";54;52;64;42;54;58;39;44;48;48;51;53
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2018";53;58;63;48;56;55;62;40;37;44;45;58
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2019";84;51;69;45;58;57;52;54;55;65;58;51
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2020";59;65;47;48;60;60;63;67;64;75;81;83
"Endokrīnās, uztures un vielmaiņas slimības (E00-E90)";"2021";84;70;57;...;...;...;...;...;...;...;...;...
"Psihiski un uzvedības traucējumi (F00-F99)";"2015";26;26;36;45;33;37;38;49;26;28;30;36
"Psihiski un uzvedības traucējumi (F00-F99)";"2016";39;45;42;29;39;32;38;38;31;38;35;43
"Psihiski un uzvedības traucējumi (F00-F99)";"2017";31;53;50;47;51;38;39;33;46;46;36;56
"Psihiski un uzvedības traucējumi (F00-F99)";"2018";54;51;65;49;50;28;55;61;51;45;49;62
"Psihiski un uzvedības traucējumi (F00-F99)";"2019";73;58;56;43;42;45;44;32;45;48;41;51
"Psihiski un uzvedības traucējumi (F00-F99)";"2020";60;48;70;55;58;59;50;60;40;50;56;72
"Psihiski un uzvedības traucējumi (F00-F99)";"2021";78;71;47;...;...;...;...;...;...;...;...;...
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2015";15;6;19;24;11;16;21;20;12;14;11;12
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2016";7;7;8;10;11;13;8;10;9;8;12;10
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2017";7;10;11;8;8;8;8;12;14;11;9;20
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2018";14;9;17;10;8;10;7;14;9;7;12;13
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2019";15;5;8;11;9;8;4;5;5;5;5;8
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2020";12;7;11;12;9;13;8;18;3;8;5;11
"..Psihiski un uzvedības traucējumi alkohola lietošanas dēļ (F10)";"2021";12;13;12;...;...;...;...;...;...;...;...;...
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2015";33;22;24;24;39;31;28;34;41;29;39;31
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2016";34;26;43;36;30;39;33;34;36;29;39;29
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2017";46;50;39;41;37;28;37;36;51;41;32;37
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2018";32;48;53;40;39;42;38;42;35;45;42;52
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2019";64;45;32;40;27;37;50;32;32;32;34;45
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2020";40;41;26;32;38;39;58;26;32;33;29;43
"Nervu sistēmas slimības un ausu un aizauss paugura slimības (G00-G99 H60-H93)";"2021";47;38;35;...;...;...;...;...;...;...;...;...
"Asinsrites sistēmas slimības (I00-I99)";"2015";1618;1412;1481;1367;1341;1252;1271;1173;1133;1380;1292;1415
"Asinsrites sistēmas slimības (I00-I99)";"2016";1637;1318;1477;1389;1339;1279;1149;1175;1138;1308;1291;1351
"Asinsrites sistēmas slimības (I00-I99)";"2017";1574;1483;1468;1352;1315;1160;1177;1123;1189;1291;1308;1391
"Asinsrites sistēmas slimības (I00-I99)";"2018";1454;1374;1762;1438;1297;1098;1226;1097;1116;1278;1203;1415
"Asinsrites sistēmas slimības (I00-I99)";"2019";1579;1287;1339;1251;1233;1103;1169;1036;1168;1248;1154;1436
"Asinsrites sistēmas slimības (I00-I99)";"2020";1435;1213;1312;1284;1260;1201;1177;1166;1181;1228;1359;1605
"Asinsrites sistēmas slimības (I00-I99)";"2021";1778;1411;1356;...;...;...;...;...;...;...;...;...
"..Akūts miokarda infarkts (I21-I22)";"2015";116;101;94;90;102;91;103;85;85;92;89;122
"..Akūts miokarda infarkts (I21-I22)";"2016";128;99;96;102;95;82;77;79;65;84;90;91
"..Akūts miokarda infarkts (I21-I22)";"2017";97;84;86;85;89;79;77;76;69;93;101;75
"..Akūts miokarda infarkts (I21-I22)";"2018";89;92;82;84;73;70;62;66;54;80;64;70
"..Akūts miokarda infarkts (I21-I22)";"2019";87;87;81;84;65;54;81;55;64;70;44;78
"..Akūts miokarda infarkts (I21-I22)";"2020";81;76;73;68;76;64;50;77;71;66;68;76
"..Akūts miokarda infarkts (I21-I22)";"2021";90;82;74;...;...;...;...;...;...;...;...;...
"..Hemorāģisks insults (I60-I62)";"2015";61;50;51;46;39;31;46;41;27;45;40;40
"..Hemorāģisks insults (I60-I62)";"2016";35;42;37;47;38;37;36;30;43;39;38;36
"..Hemorāģisks insults (I60-I62)";"2017";45;34;45;31;30;38;35;40;32;35;33;43
"..Hemorāģisks insults (I60-I62)";"2018";42;35;50;30;47;35;40;34;30;41;31;42
"..Hemorāģisks insults (I60-I62)";"2019";40;33;29;32;30;35;23;25;30;30;34;42
"..Hemorāģisks insults (I60-I62)";"2020";32;38;32;35;36;35;22;35;34;35;34;34
"..Hemorāģisks insults (I60-I62)";"2021";36;41;43;...;...;...;...;...;...;...;...;...
"..Išēmisks insults (I63-I64)";"2015";188;168;177;172;174;163;142;135;125;165;168;179
"..Išēmisks insults (I63-I64)";"2016";180;156;171;163;145;154;106;131;126;142;120;148
"..Išēmisks insults (I63-I64)";"2017";163;163;146;125;166;126;137;120;120;120;122;166
"..Išēmisks insults (I63-I64)";"2018";151;141;183;151;141;99;98;113;101;143;132;135
"..Išēmisks insults (I63-I64)";"2019";152;138;148;112;100;107;111;80;114;128;120;113
"..Išēmisks insults (I63-I64)";"2020";120;133;121;113;101;98;112;95;101;113;136;128
"..Išēmisks insults (I63-I64)";"2021";157;105;117;...;...;...;...;...;...;...;...;...
"Elpošanas sistēmas slimības (J00-J99)";"2015";74;68;85;63;69;44;55;53;33;48;73;47
"Elpošanas sistēmas slimības (J00-J99)";"2016";83;81;101;72;62;63;42;68;57;73;57;63
"Elpošanas sistēmas slimības (J00-J99)";"2017";94;120;104;71;61;43;48;46;53;67;69;66
"Elpošanas sistēmas slimības (J00-J99)";"2018";74;102;161;125;75;50;47;60;53;65;42;67
"Elpošanas sistēmas slimības (J00-J99)";"2019";118;112;91;60;57;45;39;53;44;58;42;60
"Elpošanas sistēmas slimības (J00-J99)";"2020";79;62;69;68;58;33;48;60;48;60;60;68
"Elpošanas sistēmas slimības (J00-J99)";"2021";65;56;45;...;...;...;...;...;...;...;...;...
"..Gripa un pneimonija (J09-J18)";"2015";40;35;49;35;25;19;23;29;21;18;36;29
"..Gripa un pneimonija (J09-J18)";"2016";55;45;55;40;33;23;19;34;20;31;31;27
"..Gripa un pneimonija (J09-J18)";"2017";58;70;65;39;33;20;21;25;23;30;35;29
"..Gripa un pneimonija (J09-J18)";"2018";37;65;111;70;39;18;27;35;30;33;20;34
"..Gripa un pneimonija (J09-J18)";"2019";68;83;57;32;24;21;23;24;20;30;26;34
"..Gripa un pneimonija (J09-J18)";"2020";47;33;34;33;34;13;20;31;23;32;34;43
"..Gripa un pneimonija (J09-J18)";"2021";39;33;24;...;...;...;...;...;...;...;...;...
"Gremošanas sistēmas slimības (K00-K93)";"2015";95;69;92;97;81;84;97;87;90;84;68;71
"Gremošanas sistēmas slimības (K00-K93)";"2016";121;85;101;70;86;81;74;78;89;88;78;86
"Gremošanas sistēmas slimības (K00-K93)";"2017";91;70;93;92;62;79;77;65;91;97;96;106
"Gremošanas sistēmas slimības (K00-K93)";"2018";89;84;99;99;86;86;97;84;95;78;96;82
"Gremošanas sistēmas slimības (K00-K93)";"2019";94;87;95;86;83;73;65;71;83;82;89;95
"Gremošanas sistēmas slimības (K00-K93)";"2020";67;81;78;90;86;88;74;82;61;96;91;91
"Gremošanas sistēmas slimības (K00-K93)";"2021";93;98;97;...;...;...;...;...;...;...;...;...
"Ādas un zemādas audu slimības (L00-L99)";"2015";3;6;8;4;5;8;5;7;1;2;4;4
"Ādas un zemādas audu slimības (L00-L99)";"2016";13;4;7;4;2;4;4;4;9;8;4;4
"Ādas un zemādas audu slimības (L00-L99)";"2017";6;7;3;4;2;7;4;3;7;7;6;2
"Ādas un zemādas audu slimības (L00-L99)";"2018";7;9;10;8;2;4;11;9;3;8;6;8
"Ādas un zemādas audu slimības (L00-L99)";"2019";4;8;5;4;3;7;4;3;8;6;6;8
"Ādas un zemādas audu slimības (L00-L99)";"2020";5;8;8;4;6;8;7;3;8;9;4;11
"Ādas un zemādas audu slimības (L00-L99)";"2021";6;5;5;...;...;...;...;...;...;...;...;...
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2015";4;10;11;13;7;4;3;8;4;4;13;11
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2016";5;7;5;5;8;6;6;5;11;5;6;7
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2017";7;8;8;7;3;6;5;5;4;4;10;7
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2018";7;9;6;3;6;8;6;14;11;13;9;12
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2019";8;7;10;14;8;9;9;12;9;9;17;10
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2020";4;9;9;9;10;6;4;9;4;12;9;8
"Skeleta, muskuļu un saistaudu slimības (M00-M99)";"2021";6;7;7;...;...;...;...;...;...;...;...;...
"Uroģenitālās sistēmas slimības (N00-N99)";"2015";36;32;38;37;29;35;26;35;36;31;30;24
"Uroģenitālās sistēmas slimības (N00-N99)";"2016";47;31;36;29;26;45;27;25;32;38;35;41
"Uroģenitālās sistēmas slimības (N00-N99)";"2017";33;43;44;41;32;30;35;31;35;30;29;35
"Uroģenitālās sistēmas slimības (N00-N99)";"2018";33;44;41;41;33;24;38;40;30;35;38;29
"Uroģenitālās sistēmas slimības (N00-N99)";"2019";61;35;52;29;36;33;29;34;32;31;40;42
"Uroģenitālās sistēmas slimības (N00-N99)";"2020";41;46;36;34;37;35;32;43;39;31;32;32
"Uroģenitālās sistēmas slimības (N00-N99)";"2021";36;31;39;...;...;...;...;...;...;...;...;...
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2015";3;0;1;0;0;1;1;2;1;0;0;3
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2016";0;0;0;0;1;0;0;0;1;0;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2017";0;0;0;0;0;0;0;0;0;1;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2018";0;0;0;0;0;0;1;1;0;1;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2019";0;0;0;1;1;1;1;1;0;0;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2020";0;0;0;1;0;0;1;0;1;0;0;0
"Grūtniecība, dzemdības un pēcdzemdību periods (O00-O99)";"2021";0;0;0;...;...;...;...;...;...;...;...;...
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2015";7;4;4;2;2;5;2;5;3;5;4;0
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2016";7;4;2;7;5;3;2;6;2;2;3;0
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2017";14;3;1;6;3;6;4;7;2;3;2;2
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2018";4;2;3;2;0;5;3;3;3;4;3;1
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2019";3;3;3;0;3;3;9;2;2;6;1;3
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2020";4;3;3;4;5;2;2;0;3;5;1;3
"Noteikti perinatālā perioda stāvokļi (P00-P96)";"2021";2;2;4;...;...;...;...;...;...;...;...;...
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2015";5;3;3;2;5;4;4;6;6;8;3;3
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2016";8;5;10;7;5;4;5;1;3;3;3;4
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2017";4;5;7;3;2;3;2;1;3;1;5;4
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2018";4;3;4;5;5;3;3;3;2;4;5;2
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2019";5;1;1;3;3;3;3;4;4;4;2;2
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2020";8;4;2;3;5;1;4;2;3;2;0;4
"Iedzimtas kroplības, deformācijas un hromosomu anomālijas (Q00-Q99)";"2021";3;2;0;...;...;...;...;...;...;...;...;...
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2015";26;36;24;33;27;26;26;22;21;21;24;25
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2016";30;29;33;24;32;42;37;28;24;15;26;18
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2017";25;28;38;29;29;33;35;28;26;31;21;32
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2018";16;19;35;29;31;30;45;32;22;13;14;25
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2019";34;37;40;36;25;26;44;20;21;24;27;20
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2020";32;21;35;24;28;37;26;17;19;18;29;34
"Citur neklasificēti simptomi, pazīmes un anomāla klīniska un laboratorijas atrade (R00-R99)";"2021";36;21;24;...;...;...;...;...;...;...;...;...
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2015";171;136;139;140;140;103;171;158;120;159;146;171
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2016";175;129;140;129;130;128;119;143;121;157;155;158
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2017";147;146;135;131;121;139;134;129;135;152;141;168
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2018";155;118;137;122;128;111;150;141;135;117;111;151
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2019";143;127;119;111;96;115;114;107;118;102;115;126
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2020";133;95;116;110;110;127;112;125;113;117;117;135
"Ārēji slimību un nāves cēloņi (V01-Y98)";"2021";151;118;91;...;...;...;...;...;...;...;...;...
"..Transporta nelaimes gadījumi (V01-V99)";"2015";26;7;8;14;9;15;19;31;20;22;21;26
"..Transporta nelaimes gadījumi (V01-V99)";"2016";13;11;16;14;14;19;17;18;22;18;17;15
"..Transporta nelaimes gadījumi (V01-V99)";"2017";15;13;10;10;11;14;11;12;20;11;12;15
"..Transporta nelaimes gadījumi (V01-V99)";"2018";17;10;7;9;12;15;9;17;19;23;15;22
"..Transporta nelaimes gadījumi (V01-V99)";"2019";9;14;13;11;17;14;11;14;12;14;18;12
"..Transporta nelaimes gadījumi (V01-V99)";"2020";19;8;8;5;8;15;7;16;19;15;17;15
"..Transporta nelaimes gadījumi (V01-V99)";"2021";10;9;2;...;...;...;...;...;...;...;...;...
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2015";1;7;9;6;13;11;22;24;1;9;10;13
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2016";3;9;9;8;15;20;15;17;11;13;7;8
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2017";4;4;9;10;12;12;16;18;13;12;11;10
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2018";4;2;3;13;14;16;31;16;11;5;4;5
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2019";4;6;9;8;9;19;16;7;7;6;7;6
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2020";4;4;9;6;12;23;19;11;7;5;11;17
"..Noslīkšana un slīkšana (W65-W74, Y21)";"2021";4;2;7;...;...;...;...;...;...;...;...;...
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2015";15;10;12;16;6;3;4;2;8;7;12;13
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2016";20;6;13;14;5;5;5;5;0;17;12;14
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2017";8;16;7;5;8;6;6;2;3;9;13;14
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2018";11;8;11;4;3;3;7;3;8;11;13;19
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2019";22;9;11;8;9;2;1;5;4;7;6;12
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2020";19;6;13;11;8;7;3;4;9;9;7;14
"..Pakļaušana dūmu, uguns un liesmu iedarbei (X00-X09, Y26))";"2021";23;13;10;...;...;...;...;...;...;...;...;...
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2015";24;16;8;6;3;0;1;0;1;11;8;14
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2016";40;13;14;5;2;1;1;1;2;15;18;19
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2017";21;22;17;11;2;0;2;0;2;9;15;18
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2018";18;16;14;11;0;0;0;0;4;6;5;14
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2019";19;17;12;2;2;0;0;0;7;5;10;15
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2020";17;11;13;8;3;0;2;0;2;5;7;17
"..Pārmērīga dabiska aukstuma ietekme (X31)";"2021";23;22;12;...;...;...;...;...;...;...;...;...
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2015";23;11;14;21;10;11;20;12;9;16;10;8
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2016";27;10;15;17;18;6;9;18;15;15;17;13
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2017";18;14;13;26;11;16;13;21;12;20;17;23
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2018";27;19;22;16;11;12;10;8;15;11;9;6
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2019";14;8;10;8;10;11;9;8;9;8;12;19
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2020";7;8;10;20;11;9;8;7;7;11;8;12
"..Saindēšanās un pakļaušana kaitīgu vielu iedarbei (X40-X49, Y10-Y19)";"2021";19;9;9;...;...;...;...;...;...;...;...;...
"..Saindēšanās ar alkoholu (X45 Y15)";"2015";13;8;12;16;6;10;11;10;9;10;5;5
"..Saindēšanās ar alkoholu (X45 Y15)";"2016";19;4;12;9;12;4;4;8;9;10;12;8
"..Saindēšanās ar alkoholu (X45 Y15)";"2017";14;6;10;19;11;8;7;8;6;11;7;10
"..Saindēšanās ar alkoholu (X45 Y15)";"2018";18;8;11;7;5;9;6;5;8;7;7;4
"..Saindēšanās ar alkoholu (X45 Y15)";"2019";12;7;6;3;6;6;7;3;6;6;10;12
"..Saindēšanās ar alkoholu (X45 Y15)";"2020";3;6;5;12;7;7;6;1;4;3;3;7
"..Saindēšanās ar alkoholu (X45 Y15)";"2021";12;3;4;...;...;...;...;...;...;...;...;...
"..Tīšs paškaitējums (X60-X84)";"2015";41;32;30;33;39;20;46;31;31;31;30;22
"..Tīšs paškaitējums (X60-X84)";"2016";29;33;35;23;33;30;28;31;29;28;38;27
"..Tīšs paškaitējums (X60-X84)";"2017";28;29;25;27;36;31;32;29;27;29;31;29
"..Tīšs paškaitējums (X60-X84)";"2018";19;20;21;18;36;22;35;26;31;23;20;28
"..Tīšs paškaitējums (X60-X84)";"2019";23;27;24;26;19;24;32;27;25;25;18;18
"..Tīšs paškaitējums (X60-X84)";"2020";26;19;27;23;23;30;34;32;23;25;23;12
"..Tīšs paškaitējums (X60-X84)";"2021";17;17;15;...;...;...;...;...;...;...;...;...
"..Vardarbība (X85-Y09)";"2015";9;5;8;7;7;4;8;7;5;13;11;15
"..Vardarbība (X85-Y09)";"2016";14;4;3;13;6;4;8;7;6;14;4;7
"..Vardarbība (X85-Y09)";"2017";11;4;4;2;5;9;8;6;8;5;5;7
"..Vardarbība (X85-Y09)";"2018";8;7;3;6;5;3;6;10;9;4;5;10
"..Vardarbība (X85-Y09)";"2019";7;5;6;6;5;5;9;5;5;1;2;6
"..Vardarbība (X85-Y09)";"2020";7;3;2;5;2;10;5;6;6;6;7;4
"..Vardarbība (X85-Y09)";"2021";3;5;4;...;...;...;...;...;...;...;...;...
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2015";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2016";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2017";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2018";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2019";0;0;0;0;0;0;0;0;0;0;0;0
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2020";0;0;0;9;3;2;1;1;2;24;126;532
"Īpašiem gadījumiem paredzētie kodi (U00-U85)";"2021";642;416;267;...;...;...;...;...;...;...;...;...
"..Covid-19 (U07.1, U07.2)";"2015";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2016";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2017";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2018";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2019";x;x;x;x;x;x;x;x;x;x;x;x
"..Covid-19 (U07.1, U07.2)";"2020";0;0;0;9;3;2;1;1;2;24;126;532
"..Covid-19 (U07.1, U07.2)";"2021";642;415;262;...;...;...;...;...;...;...;...;...
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2015";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2016";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2017";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2018";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2019";x;x;x;x;x;x;x;x;x;x;x;x
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2020";0;0;0;0;0;0;0;0;0;0;0;0
"..Stāvoklis pēc pārslimota Covid-19 (U09)";"2021";0;1;5;...;...;...;...;...;...;...;...;...`;

/*
 * Return value of this function can be easily manipulated by the
 * app logic if necessary, for example, toggling which lines to show.
 */
function parseData(data) {
    return data.split(/\n/).reduce(function (memo, line) {
        var columns = line.split(";");
        var name = columns[0].replace(/\"/g, "");

        if (!memo.hasOwnProperty(name)) {
            memo[name] = [];
        }

        for (var i = 1; i <= 12; i++) {
            var raw_value = columns[i + 1];

            if (raw_value === "...") {
                continue;
            }

            var value = raw_value === "x"
                ? 0
                : raw_value.indexOf(".") === -1
                    ? parseInt(raw_value, 10)
                    : parseFloat(raw_value);

            memo[name].push(value);
        }

        return memo;
    }, {});
}

function createMonthLabels() {
    var labels = [];
    var fullYears = [2015, 2016, 2017, 2018, 2019, 2020];
    for (var i = 1; i <= 12 * fullYears.length; i++) {
        var year = fullYears[Math.floor((i - 1) / 12)];
        var month = (i % 12) > 0 ? (i % 12) : 12;

        labels.push(new Date(year, month - 1).getTime());
    }

    // January & February & March 2021
    labels.push(new Date(2021, 0).getTime());
    labels.push(new Date(2021, 1).getTime());
    labels.push(new Date(2021, 2).getTime());

    return labels;
}

function convertParsedDataToChartFormat(parsedData) {
    return Object.keys(parsedData).reduce(function (memo, curr, index) {
        memo.push(parsedData[curr]);
        return memo;
    }, [createMonthLabels()]);
}

var spkc_data = {};
spkc_data.absolute = {};
spkc_data.absolute.parsed = parseData(MOR10_absolute);
spkc_data.absolute.chart = convertParsedDataToChartFormat(spkc_data.absolute.parsed);
spkc_data.relative = {};
spkc_data.relative.parsed = parseData(MOR10_relative_100000);
spkc_data.relative.chart = convertParsedDataToChartFormat(spkc_data.relative.parsed);

function randomColor() {
    var color = "#";
    for (var i = 0; i < 3; i++) {
        var randomHexString = Math.floor(Math.random() * 256).toString(16);

        if (randomHexString.length === 1) {
            randomHexString = "0" + randomHexString;
        }

        color += randomHexString;
    }
    return color;
}

function createSeries(parsedData) {
    return Object.keys(parsedData).reduce(function(memo, curr) {
        memo.push({
            label: curr,
            stroke: randomColor(),
        });
        return memo;
    }, [{}]);
}

// var data_type = "relative";
var data_type = "absolute";
var data = spkc_data[data_type].chart;
var series = createSeries(spkc_data[data_type].parsed);

const opts = {
    width: 1000,
    height: 600,
    title: "MOR10",
    scales: {
        x: {
            time: false,
            // snap x-zoom to exact data values
            range: (u, min, max) => [
                data[0][u.valToIdx(min)],
                data[0][u.valToIdx(max)],
            ],
        },
    },
    hooks: {
    },
    series: series,
    axes: [
        {
            values: function(u, t) {
                return t.map(function (v) {
                    var date = new Date(v);
                    return (date.getMonth() + 1) + "/" + String(date.getFullYear()).substr(2, 2);
                });
            },
        },
    ],
};

var plot = new uPlot(opts, data, document.body);

Array.from(document.querySelectorAll('input[type="radio"]')).forEach(function(element) {
    element.addEventListener("change", function () {
        if (element.checked) {
            plot.setData(spkc_data[element.getAttribute("value")].chart);
        }
    });
});
